tap "beeftornado/rmtree"
tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Automatic configure script builder
brew "autoconf"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reduce a C/C++ program while keeping a property of interest
brew "creduce"
# Reimplementation of ctags(1)
brew "ctags"
# Tools and libraries to manipulate images in many formats
brew "imagemagick", args: ["with-librsvg"]
# Read and write data matrix barcodes
brew "dmtx-utils", link: false
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Next generation open source RPC library and framework
brew "grpc"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Open source relational database management system
brew "mysql"
# Network grep
brew "ngrep"
# Manage multiple Node.js versions
brew "nvm"
# Extract just secret information out of OpenPGP secret keys
brew "paperkey"
# Highly capable, feature-rich programming language
brew "perl"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Feature-rich console based todo list manager
brew "task"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim", args: ["with-override-system-vi"]
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# Recursively search directories for a regex pattern.
brew "burntsushi/ripgrep/ripgrep-bin"
cask "1password"
cask "android-platform-tools"
cask "android-studio"
cask "charles"
cask "goland"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "licecap"
cask "robo-3t"
cask "slack"
cask "spectacle"
cask "webstorm"
