tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "versent/taps"
# Automatic configure script builder
brew "autoconf"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Authenticate with AWS using your Okta credentials
brew "aws-okta"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Core application library for C
brew "glib"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reduce a C/C++ program while keeping a property of interest
brew "creduce"
# Reimplementation of ctags(1)
brew "ctags"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# HTTP/2 C Library
brew "nghttp2"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Next generation open source RPC library and framework
brew "grpc"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Small utility for manipulating IPv6 addresses
brew "ipv6calc"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Command-line utility to interact with linkerd
brew "linkerd"
# Securely transfers data between computers
brew "magic-wormhole"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Experimental optional static type checker for Python
brew "mypy"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# QR Code generation
brew "qrencode"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Tool for managing your YubiKey configuration
brew "ykman"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Recursively search directories for a regex pattern.
brew "burntsushi/ripgrep/ripgrep-bin"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
brew "versent/taps/saml2aws"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Web debugging Proxy application
cask "charles"
cask "day-o"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# Animated screen capture application
cask "licecap"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MongoDB management tool
cask "robo-3t"
# Team communication and collaboration software
cask "slack"
# JavaScript IDE
cask "webstorm"
