tap "beeftornado/rmtree"
tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "versent/taps"
# Automatic configure script builder
brew "autoconf"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: true
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Core application library for C
brew "glib"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reduce a C/C++ program while keeping a property of interest
brew "creduce"
# Reimplementation of ctags(1)
brew "ctags"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Next generation open source RPC library and framework
brew "grpc"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Small utility for manipulating IPv6 addresses
brew "ipv6calc"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library to render SVG files using Cairo
brew "librsvg"
# Securely transfers data between computers
brew "magic-wormhole"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Experimental optional static type checker for Python
brew "mypy"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Network grep
brew "ngrep"
# Manage multiple Node.js versions
brew "nvm"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Monitor data's progress through a pipe
brew "pv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Recursively search directories for a regex pattern.
brew "burntsushi/ripgrep/ripgrep-bin"
brew "versent/taps/saml2aws"
cask "1password"
cask "android-platform-tools"
cask "android-studio"
cask "charles"
cask "day-o"
cask "goland"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "licecap"
cask "rectangle"
cask "robo-3t"
cask "slack"
cask "webstorm"
